app/controllers/admin_controller.rb

SELECT * FROM `widgets` WHERE (`widgets`.`id` = 1)
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
---
  def pages
    @page = 'pages'
    @widgets = Widget.find(:all)
    @layouts = WidgetLayout.find(:all)
    @pages = Page.find(:all)

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def users
    @page = 'users'
    respond_to do |format|
      format.html {
        @users = User.find(:all)

SELECT * FROM `pages` WHERE (`pages`.`id` = 3)
---
  def page_edit
    @page = Page.find(params[:id])